In [1]:
print("My class information")

My class information

In [2]:
import pandas as pd

In [3]:
pd.read_excel(r"C:\Users\vkojh\Desktop\DataSet01.xlsx")

           Name   Batch No  Roll No           Address
0       Mahakal   Python01       120          Gurgaon
1  Sweta Bhabhi  Jupitor02       121            Noida
2  Vimlesh Ojha   Python03       122        Sultanpur
3   Subh Tiwari          4       123  Noida Sector 70
4  Pawan Bhaiya          5       124          Glasgow

In [4]:
pd.read_csv(r"C:\Users\vkojh\Desktop\DataSet02.csv")

           Name   Batch No  Roll No           Address  Fee Amount
0       Mahakal   Python01       120          Gurgaon       15999
1  Sweta Bhabhi  Jupitor02       121            Noida       12999
2  Vimlesh Ojha   Python03       122        Sultanpur       15999
3   Subh Tiwari          4       123  Noida Sector 70       16999
4  Pawan Bhaiya          5       124          Glasgow       19999

In [19]:
pd.read_csv(r'C:\Users\vkojh\Desktop\DataSet03.tsv',sep='\t')

    Name    Phone No Address  Batch No
0  Allen  9893658658    Noid         2
1  Zosef  9204524752  Kanpur         9
2  Shyam  9839324198   delhi         5